simulations/test_box_sh/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

// Domain Bounds (Params to be replaced or set large enough for typical hull)
// Hull CoM roughly at (L/2, 0, D/2) or (0,0,0)?
// simple_box is 100x20x10.
// Let's assume standard resistance domain:
// -1.0 L upstream, 3.0 L downstream
// 1.5 L side, 1.0 L deep?

xmin -100;
xmax  400;
ymin -150;
ymax  150;
zmin -100;
zmax  100; // Air height

vertices
(
    ($xmin $ymin $zmin) // 0
    ($xmax $ymin $zmin) // 1
    ($xmax $ymax $zmin) // 2
    ($xmin $ymax $zmin) // 3
    ($xmin $ymin $zmax) // 4
    ($xmax $ymin $zmax) // 5
    ($xmax $ymax $zmax) // 6
    ($xmin $ymax $zmax) // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 20 20) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    bottom
    {
        type symmetryPlane; // or wall
        faces
        (
            (0 3 2 1)
        );
    }
    top
    {
        type patch; // atmosphere
        faces
        (
            (4 5 6 7)
        );
    }
    sides
    {
        type symmetryPlane;
        faces
        (
            (0 1 5 4)
            (3 7 6 2)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
