simulations/test_box_sh/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         100; // Seconds

deltaT          0.01;

writeControl    runTime;

writeInterval   5; // Write every 5 seconds

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  true;

maxCo           1.0; // VOF needs low Co usually, but we start with 1.0
maxAlphaCo      1.0;

maxDeltaT       1;

// Function objects
functions
{
    forces
    {
        type            forces;
        libs            ("libforces.so");
        writeControl    timeStep;
        writeInterval   1;
        
        patches         (hull);
        p               p_rgh;
        U               U;
        rho             rhoInf;
        rhoInf          1025; // Salt water
        CofR            (50 0 5); // Center of Rotation approx
    }
}

// ************************************************************************* //
